In [1]:
import numpy as np
import pandas as pd

# Creating Dataframe object

In [2]:
arr = np.random.randint(0,100,(5,3))

In [3]:
df = pd.DataFrame(arr)
print(df)

    0   1   2
0  84  92  41
1  92  42  14
2  87  80  11
3  84  14  36
4  58   7  52

In [4]:
print(df.values,df.index,df.columns)

[[84 92 41]
 [92 42 14]
 [87 80 11]
 [84 14 36]
 [58  7 52]] RangeIndex(start=0, stop=5, step=1) RangeIndex(start=0, stop=3, step=1)

In [5]:
df.values[0]

array([84, 92, 41])

In [6]:
df.values[:,0]

array([84, 92, 87, 84, 58])

In [7]:
df.index = ['R1','R2','R3','R4','R5']
df.columns = ['C1','C2','C3']

In [8]:
df

    C1  C2  C3
R1  84  92  41
R2  92  42  14
R3  87  80  11
R4  84  14  36
R5  58   7  52

In [9]:
df.loc['R3','C2']

80

In [10]:
df.iloc[2,1]

80

In [11]:
type(df.iloc[0])

pandas.core.series.Series

In [12]:
df.iloc[:,0]

R1    84
R2    92
R3    87
R4    84
R5    58
Name: C1, dtype: int64

In [13]:
def create_df(nRows,nCols,maxRand=100):
    """This function create a DataFrame Object with values between 0 to maxRand whose default value is 100.
    The values of nRows and nCols specifies the shape of the DataFrame"""
    list_index=[]
    list_columns=[]
    for i in range(1,nRows+1):
        list_index.append("R"+str(i))
    for i in range(1,nCols+1):
        list_columns.append("C"+str(i))
    df = pd.DataFrame(np.random.randint(0,maxRand,(nRows,nCols)),index=list_index,columns=list_columns)
    return df

In [14]:
create_df(5,3)

    C1  C2  C3
R1  18  38  66
R2  78  40  23
R3  19  64  50
R4  88  25  25
R5  60  65  11

In [15]:
create_df?

In [16]:
mass = pd.Series([5.97,1898,0.642,0.33,102,0.0146,568,86.8,4.87], index=["Earth","Jupiter","Mars","Mercury","Neptune","Pluto","Saturn","Uranus","Venus"])
diameter = pd.Series([12756,142984,6792,4879,3475,49528,2370,120536,51118,12104], index =["Earth","Jupiter","Mars","Mercury","Moon","Neptune","Pluto","Saturn","Uranus","Venus"])

In [17]:
mass

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
dtype: float64

In [18]:
diameter

Earth       12756
Jupiter    142984
Mars         6792
Mercury      4879
Moon         3475
Neptune     49528
Pluto        2370
Saturn     120536
Uranus      51118
Venus       12104
dtype: int64

In [19]:
planets = pd.DataFrame({"Mass":mass, "Diameter":diameter})

In [20]:
planets

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [21]:
planets.T

,Earth,Jupiter,Mars,Mercury,Moon,Neptune,Pluto,Saturn,Uranus,Venus
Mass,5.97,1898.0,0.642,0.33,NaN,102.0,0.0146,568.0,86.8,4.87
Diameter,12756.00,142984.0,6792.000,4879.00,3475.0,49528.0,2370.0000,120536.0,51118.0,12104.00

In [22]:
planets['Population']= 0.0

In [23]:
planets

              Mass  Diameter  Population
Earth       5.9700     12756         0.0
Jupiter  1898.0000    142984         0.0
Mars        0.6420      6792         0.0
Mercury     0.3300      4879         0.0
Moon           NaN      3475         0.0
Neptune   102.0000     49528         0.0
Pluto       0.0146      2370         0.0
Saturn    568.0000    120536         0.0
Uranus     86.8000     51118         0.0
Venus       4.8700     12104         0.0

In [24]:
planets["Population"]["Earth"] = 8.3

<ipython-input-24-4422e4331208>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  planets["Population"]["Earth"] = 8.3

In [25]:
planets

              Mass  Diameter  Population
Earth       5.9700     12756         8.3
Jupiter  1898.0000    142984         0.0
Mars        0.6420      6792         0.0
Mercury     0.3300      4879         0.0
Moon           NaN      3475         0.0
Neptune   102.0000     49528         0.0
Pluto       0.0146      2370         0.0
Saturn    568.0000    120536         0.0
Uranus     86.8000     51118         0.0
Venus       4.8700     12104         0.0

In [26]:
planets.loc['Earth','Mass']

5.97

In [27]:
planets.iloc[0]

Mass              5.97
Diameter      12756.00
Population        8.30
Name: Earth, dtype: float64

In [28]:
planets.columns

Index(['Mass', 'Diameter', 'Population'], dtype='object')

In [29]:
planets.loc[:,'Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [30]:
def create_mean_row(df):
    #df.loc['Mean']= [np.mean(df[col]) for col in df.columns]
    df.loc['Mean'] = df.mean()
    return df

In [31]:
create_mean_row(planets)

                Mass  Diameter  Population
Earth       5.970000   12756.0        8.30
Jupiter  1898.000000  142984.0        0.00
Mars        0.642000    6792.0        0.00
Mercury     0.330000    4879.0        0.00
Moon             NaN    3475.0        0.00
Neptune   102.000000   49528.0        0.00
Pluto       0.014600    2370.0        0.00
Saturn    568.000000  120536.0        0.00
Uranus     86.800000   51118.0        0.00
Venus       4.870000   12104.0        0.00
Mean      296.291844   40654.2        0.83

In [47]:
planets.iloc[:,0]

Earth         5.970000
Jupiter    1898.000000
Mars          0.642000
Mercury       0.330000
Moon               NaN
Neptune     102.000000
Pluto         0.014600
Saturn      568.000000
Uranus       86.800000
Venus         4.870000
Mean        296.291844
Name: Mass, dtype: float64

## Getting started with Datasets

In [48]:
import seaborn as sns

In [170]:
df = sns.load_dataset('planets')

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [153]:
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [154]:
df.tail(10)

       method  number  orbital_period  mass  distance  year
1025  Transit       1        3.067850   NaN      60.0  2012
1026  Transit       1        0.925542   NaN     470.0  2014
1027  Imaging       1             NaN   NaN      19.2  2011
1028  Transit       1        3.352057   NaN    3200.0  2012
1029  Imaging       1             NaN   NaN      10.1  2012
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [155]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

## Go through each row of the data frame and delete it if it's Null

In [156]:
pd.DataFrame.dropna(df,inplace=True)

In [157]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [61]:
for i, r in df.iterrows():
    if pd.isnull(r).any():
        df.drop(index=i,inplace=True)

In [62]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

## Filter and show only those planets which are found in 2010s and method is Radial Velocity and Transit and distance is large (> 75th percentile)

In [68]:
df_2010 = df[(df["year"]==2010)]

In [75]:
df_methodfilter =df_2010[df_2010["method"]== ("Radial Velocity" or "Transit")]

In [76]:
df_methodfilter.describe()

          number  orbital_period       mass    distance    year
count  41.000000       41.000000  41.000000   41.000000    41.0
mean    2.195122      819.593669   1.289610   49.539268  2010.0
std     1.763796     1280.499920   2.289468   39.874705     0.0
min     1.000000        2.645610   0.013000    4.700000  2010.0
25%     1.000000       68.270000   0.150000   20.210000  2010.0
50%     1.000000      327.800000   0.600000   39.390000  2010.0
75%     2.000000     1050.300000   1.160000   65.620000  2010.0
max     6.000000     5584.000000  13.000000  223.210000  2010.0

In [92]:
df_final = df_methodfilter[df_methodfilter["distance"]>np.percentile(df["distance"].values,75)]

In [93]:
df_final

              method  number  orbital_period   mass  distance  year
9    Radial Velocity       2         452.800  1.990     74.79  2010
10   Radial Velocity       2         883.000  0.860     74.79  2010
166  Radial Velocity       2        5584.000  3.400     90.00  2010
415  Radial Velocity       1           6.495  0.960    121.07  2010
429  Radial Velocity       1          68.270  0.770     65.62  2010
483  Radial Velocity       1         176.300  2.900    126.10  2010
519  Radial Velocity       2          75.290  0.770     69.44  2010
520  Radial Velocity       2        1314.000  2.290     69.44  2010
573  Radial Velocity       2         613.800  1.850     68.35  2010
574  Radial Velocity       2         825.000  0.895     68.35  2010
627  Radial Velocity       1          16.200  1.250    223.21  2010

In [94]:
np.percentile(df["distance"].values,75)

59.3325

In [95]:
df_final.describe()

          number  orbital_period       mass    distance    year
count  11.000000       11.000000  11.000000   11.000000    11.0
mean    1.636364      910.468636   1.630455   95.560000  2010.0
std     0.504525     1608.507863   0.925474   47.448239     0.0
min     1.000000        6.495000   0.770000   65.620000  2010.0
25%     1.000000       71.780000   0.877500   68.895000  2010.0
50%     2.000000      452.800000   1.250000   74.790000  2010.0
75%     2.000000      854.000000   2.140000  105.535000  2010.0
max     2.000000     5584.000000   3.400000  223.210000  2010.0

In [96]:
df_final["mass"]

9      1.990
10     0.860
166    3.400
415    0.960
429    0.770
483    2.900
519    0.770
520    2.290
573    1.850
574    0.895
627    1.250
Name: mass, dtype: float64

In [98]:
df_final.loc[9]

method            Radial Velocity
number                          2
orbital_period              452.8
mass                         1.99
distance                    74.79
year                         2010
Name: 9, dtype: object

In [146]:
# Another way to query
df_ = df.copy()
per_75 = df.distance.quantile(0.75)
for i,r in df_.iterrows():
    if r['year'] != 2010:
        df_.drop(i,inplace= True)
        continue
    if r['method']!= "Radial Velocity" and r['method']!= "Transit" :
        df_.drop(i,inplace = True)
        continue
    if r['distance']<= per_75:
        df_.drop(i,inplace= True)
        continue

In [147]:
df_.describe()

          number  orbital_period       mass    distance    year
count  11.000000       11.000000  11.000000   11.000000    11.0
mean    1.636364      910.468636   1.630455   95.560000  2010.0
std     0.504525     1608.507863   0.925474   47.448239     0.0
min     1.000000        6.495000   0.770000   65.620000  2010.0
25%     1.000000       71.780000   0.877500   68.895000  2010.0
50%     2.000000      452.800000   1.250000   74.790000  2010.0
75%     2.000000      854.000000   2.140000  105.535000  2010.0
max     2.000000     5584.000000   3.400000  223.210000  2010.0

In [120]:
df2 = df[
    (df['year']==2010)&
    ((df['method']=='Radial Velocity') | (df['method']== 'Transit')) &
    (df['distance'] > per_75)
]

In [122]:
df2.describe()

          number  orbital_period       mass    distance    year
count  11.000000       11.000000  11.000000   11.000000    11.0
mean    1.636364      910.468636   1.630455   95.560000  2010.0
std     0.504525     1608.507863   0.925474   47.448239     0.0
min     1.000000        6.495000   0.770000   65.620000  2010.0
25%     1.000000       71.780000   0.877500   68.895000  2010.0
50%     2.000000      452.800000   1.250000   74.790000  2010.0
75%     2.000000      854.000000   2.140000  105.535000  2010.0
max     2.000000     5584.000000   3.400000  223.210000  2010.0

## Modify the method values to have only Abbreivations

In [183]:
df = sns.load_dataset('planets')

In [158]:
set(df.loc[:,"method"])

{'Radial Velocity', 'Transit'}

In [159]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [160]:
df['method']

0      Radial Velocity
1      Radial Velocity
2      Radial Velocity
3      Radial Velocity
4      Radial Velocity
            ...
640    Radial Velocity
641    Radial Velocity
642    Radial Velocity
649            Transit
784    Radial Velocity
Name: method, Length: 498, dtype: object

In [166]:
for item in df.loc[:,'method'].index:
    if df.loc[item,'method'] == "Radial Velocity":
        df.loc[item,'method'] = "RV"
    if df.loc[item,'method'] == "Transit":
        df.loc[item,'method'] = "T"

In [191]:
#Reloaded original data
df.method.unique()

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [178]:
# abbreivation fn
def abb(text):
    words = text.split()
    short = ""
    for item in words:
        short+=item[0]
    return short

In [179]:
abb("Radial Velocity")

'RV'

In [182]:
sank = "Sanketh"
''.join([i[0] for i in sank.split()])

'S'

In [186]:
short_names = {}
for s in df.method.unique():
    short_names[s]= ''.join([i[0] for i in s.split()])

In [187]:
short_names

{'Radial Velocity': 'RV',
 'Imaging': 'I',
 'Eclipse Timing Variations': 'ETV',
 'Transit': 'T',
 'Astrometry': 'A',
 'Transit Timing Variations': 'TTV',
 'Orbital Brightness Modulation': 'OBM',
 'Microlensing': 'M',
 'Pulsar Timing': 'PT',
 'Pulsation Timing Variations': 'PTV'}

In [192]:
for i,r in df.iterrows():
    df.loc[i,'short_method']= short_names.get(r['method'],r['method'])

In [194]:
df.tail()

       method  number  orbital_period  mass  distance  year short_method
1030  Transit       1        3.941507   NaN     172.0  2006            T
1031  Transit       1        2.615864   NaN     148.0  2007            T
1032  Transit       1        3.191524   NaN     174.0  2007            T
1033  Transit       1        4.125083   NaN     293.0  2008            T
1034  Transit       1        4.187757   NaN     260.0  2008            T